btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+4] when IOPOE bit 4 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>7</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>6</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>5</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>4</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>3</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_MOSI</name>
                  <value>2</value>
                  <description>Peripheral output mux selects AUX_SPIM MOSI.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_SCLK</name>
                  <value>1</value>
                  <description>Peripheral output mux selects AUX_SPIM SCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO5PSEL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Input Output 5 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+5] when IOPOE bit 5 is 1. 

To avoid glitches on AUXIO[8i+5] you must configure this register while IOPOE bit 5 is 0.

In the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SRC</name>
              <description>[2:0] Select a peripheral signal that connects to AUXIO[8i+5] when IOPOE bit 5 is set.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>7</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>6</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>5</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>4</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>3</value>
                  <description>Peripheral output mux selects asynchronous version of AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_MOSI</name>
                  <value>2</value>
                  <description>Peripheral output mux selects AUX_SPIM MOSI.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SPIM_SCLK</name>
                  <value>1</value>
                  <description>Peripheral output mux selects AUX_SPIM SCLK.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_EV_OBS</name>
                  <value>0</value>
                  <description>Peripheral output mux selects event selected by AUX_EVCTL:EVOBSCFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IO6PSEL</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Input Output 6 Peripheral Select

This register selects a peripheral signal that connects to AUXIO[8i+6] when IOPOE bit 6 is 1. 

