btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
If AUX_SYSIF:OPMODEREQ.REQ equals PDLP, you must set:
- H_PER = L_PER = HOLD_INTERVAL = 0.</description>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>H_PER</name>
              <description>[14:14] High time.

The sample clock period is high for this many base periods.

0: 2 periods
1: 4 periods</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>L_PER</name>
              <description>[13:12] Low time.

The sample clock period is low for this many base periods.

0: 1 period
1: 2 periods
2: 3 periods
3: 4 periods</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>SETUP_CNT</name>
              <description>[11:8] Setup count.

Number of active sample clock periods during the setup phase.

0: 1 sample clock period 
1: 2 sample clock periods 
... 
15 : 16 sample clock periods</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HOLD_INTERVAL</name>
              <description>[7:0] Hold interval.

Number of inactive sample clock periods between each active sample clock period during hold phase. The sample clock is low when inactive. 

The range is 0 to 255.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACVALUE</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>DAC Value</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[7:0] DAC value.

Digital data word for the DAC.

Only change VALUE when DACCTL.DAC_EN is 0. Then wait 1 us before you enable the DAC.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DACSTAT</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>DAC Status</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SETUP_ACTIVE</name>
              <description>[1:1] DAC setup phase status.

0: Sample clock is disabled or setup phase is complete.
1: Setup phase in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>HOLD_ACTIVE</name>
              <description>[0:0] DAC hold phase status.

0: Sample clock is disabled or DAC is not in hold phase.
1: Hold phase in progress.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_EVCTL</name>
      <baseAddress>0x400C5000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Event Controller (AUX_EVCTL) assembles events originating from:
- AUX submodules, including ADC and comparators.
- AUXIO.
- EVENT.
- AON_PMCTL.
- AON_RTC.
- AON_BATMON.

into two 64-bit event buses. One is synchronized to the AUX clock and one is left unsynchronized. 

The subscribers to the synchronous event bus are AUX_TIMER01, AUX_SCE and AUX_EVCTL.
The subscribers to the asynchronous event bus are AUX_TIMER2, AUX_ANAIF, AUX_TDC and AUX_SYSIF.

AUX_EVCTL uses the synchronous event bus to generate events to AON_EVENT and EVENT, as well as to AUX_SCE. AUX_SCE can poll event status registers and combine certain instructions like WEV0, WEV1 with one or two configurable events. The latter saves power when execution must stall until a condition is met.</description>
      <registers>
        <register>
          <name>EVSTAT0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Event Status 0

Register holds events 0 thru 15 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
- AUX_TIMER2.
- AUX_ANAIF.
- AUX_TDC.
- AUX_SYSIF.
- AUX_AIODIOn.
- EVOBSCFG.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUXIO15</name>
              <description>[15:15] AUXIO15 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUXIO14</name>
              <description>[14:14] AUXIO14 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUXIO13</name>
              <description>[13:13] AUXIO13 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUXIO12</name>
              <description>[12:12] AUXIO12 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUXIO11</name>
              <description>[11:11] AUXIO11 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUXIO10</name>
              <description>[10:10] AUXIO10 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUXIO9</name>
              <description>[9:9] AUXIO9   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUXIO8</name>
              <description>[8:8] AUXIO8   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUXIO7</name>
              <description>[7:7] AUXIO7   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUXIO6</name>
              <description>[6:6] AUXIO6   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUXIO5</name>
              <description>[5:5] AUXIO5   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUXIO4</name>
              <description>[4:4] AUXIO4   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUXIO3</name>
              <description>[3:3] AUXIO3   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUXIO2</name>
              <description>[2:2] AUXIO2   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUXIO1</name>
              <description>[1:1] AUXIO1   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUXIO0</name>
              <description>[0:0] AUXIO0   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Event Status 1

Register holds events 16 thru 31 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
- AUX_TIMER2.
- AUX_ANAIF.
- AUX_TDC.
- AUX_SYSIF.
- AUX_AIODIOn.
- EVOBSCFG.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUXIO31</name>
              <description>[15:15] AUXIO31 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUXIO30</name>
              <description>[14:14] AUXIO30 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUXIO29</name>
              <description>[13:13] AUXIO29 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUXIO28</name>
              <description>[12:12] AUXIO28 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUXIO27</name>
              <description>[11:11] AUXIO27 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUXIO26</name>
              <description>[10:10] AUXIO26 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUXIO25</name>
              <description>[9:9] AUXIO25 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUXIO24</name>
              <description>[8:8] AUXIO24 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUXIO23</name>
              <description>[7:7] AUXIO23 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUXIO22</name>
              <description>[6:6] AUXIO22 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUXIO21</name>
              <description>[5:5] AUXIO21 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUXIO20</name>
              <description>[4:4] AUXIO20 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUXIO19</name>
              <description>[3:3] AUXIO19 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUXIO18</name>
              <description>[2:2] AUXIO18 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUXIO17</name>
              <description>[1:1] AUXIO17 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUXIO16</name>
              <description>[0:0] AUXIO16 pin level, read value corresponds to AUX_AIODIO2:GPIODIN bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Event Status 2

Register holds events 32 thru 47 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
- AUX_TIMER2.
- AUX_ANAIF.
- AUX_TDC.
- AUX_SYSIF.
- AUX_AIODIOn.
- EVOBSCFG.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>[15:15] Comparator B output. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_COMPB_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>[14:14] Comparator A output. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_COMPA_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>MCU_OBSMUX1</name>
              <description>[13:13] Observation input 1 from IOC. 
This event is configured by IOC:OBSAUXOUTPUT.SEL1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>[12:12] Observation input 0 from IOC. 
This event is configured by IOC:OBSAUXOUTPUT.SEL0 and can be overridden by IOC:OBSAUXOUTPUT.SEL_MISC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MCU_EV</name>
              <description>[11:11] Event from EVENT configured by EVENT:AUXSEL0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>ACLK_REF</name>
              <description>[10:10] TDC reference clock.
It is configured by DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL and enabled by AUX_SYSIF:TDCREFCLKCTL.REQ.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>VDDR_RECHARGE</name>
              <description>[9:9] Event is high during VDDR recharge.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MCU_ACTIVE</name>
              <description>[8:8] Event is high while system(MCU, AUX, or JTAG domains) is active or transitions to active (GLDO or DCDC power supply state). Event is not high during VDDR recharge.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PWR_DWN</name>
              <description>[7:7] Event is high while system(MCU, AUX, or JTAG domains) is in powerdown (uLDO power supply).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>SCLK_LF</name>
              <description>[6:6] SCLK_LF clock</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AON_BATMON_TEMP_UPD</name>
              <description>[5:5] Event is high for two SCLK_MF clock periods when there is an update of AON_BATMON:TEMP.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AON_BATMON_BAT_UPD</name>
              <description>[4:4] Event is high for two SCLK_MF clock periods when there is an update of AON_BATMON:BAT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AON_RTC_4KHZ</name>
              <description>[3:3] AON_RTC:SUBSEC.VALUE bit 19.
AON_RTC:CTL.RTC_4KHZ_EN enables this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AON_RTC_CH2_DLY</name>
              <description>[2:2] AON_RTC:EVFLAGS.CH2 delayed by AON_RTC:CTL.EV_DELAY configuration.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AON_RTC_CH2</name>
              <description>[1:1] AON_RTC:EVFLAGS.CH2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MANUAL_EV</name>
              <description>[0:0] Programmable event. See MANUAL for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSTAT3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Event Status 3

Register holds events 48 thru 63 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
- AUX_TIMER2.
- AUX_ANAIF.
- AUX_TDC .
- AUX_SYSIF.
- AUX_AIODIOn.
- EVOBSCFG.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_CLKSWITCH_RDY</name>
              <description>[15:15] AUX_SYSIF:TIMER2CLKSWITCH.RDY</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>AUX_DAC_HOLD_ACTIVE</name>
              <description>[14:14] AUX_ANAIF:DACSTAT.HOLD_ACTIVE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>[13:13] See AUX_SMPH:AUTOTAKE.SMPH_ID for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_FIFO_NOT_EMPTY</name>
              <description>[12:12] AUX_ANAIF:ADCFIFOSTAT.EMPTY negated</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>[11:11] AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>[10:10] The logical function for this event is configurable.

