btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
When DMACTL.EN = 1 : 
   Event = UDMA0 Channel 7 done event     OR     AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW

When DMACTL.EN = 0 :
   Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR      AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW  

Bit 7 in UDMA0:DONEMASK must be 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>[9:9] AUX_ANAIF ADC conversion done event. 
Event is synchronized at AUX bus rate.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AUX_ISRC_RESET_N</name>
              <description>[8:8] AUX_ANAIF:ISRCCTL.RESET_N</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>[7:7] AUX_TDC:STAT.DONE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>[6:6] AUX_TIMER0_EV event, see AUX_TIMER01:T0TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>[5:5] AUX_TIMER1_EV event, see AUX_TIMER01:T1TARGET for description.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>[4:4] AUX_TIMER2 pulse event. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>[3:3] AUX_TIMER2 event output 3. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>[2:2] AUX_TIMER2 event output 2. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>[1:1] AUX_TIMER2 event output 1. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>[0:0] AUX_TIMER2 event output 0. 
Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the synchronization rate for this event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCEWEVCFG0</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Sensor Controller Engine Wait Event Configuration 0

Configuration of this register and SCEWEVCFG1 controls bit index 7 in AUX_SCE:WUSTAT.EV_SIGNALS. This bit can be used by AUX_SCE WEV0, WEV1, BEV0 and BEV1 instructions. 

When COMB_EV_EN = 0:
AUX_SCE:WUSTAT.EV_SIGNALS (7) =  EV0_SEL event

When  COMB_EV_EN = 1:
AUX_SCE:WUSTAT.EV_SIGNALS (7) =  ( EV0_SEL event )  OR  ( SCEWEVCFG1.EV1_SEL event )

Bit fields SCEWEVCFG1.EV0_POL and SCEWEVCFG1.EV1_POL control the polarity of selected events.

Event combination is useful when there is a need to wait for a certain condition with timeout.</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>COMB_EV_EN</name>
              <description>[6:6] Event combination control:

0: Disable event combination.
1: Enable event combination.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>EV0_SEL</name>
              <description>[5:0] Select the event source from the synchronous event bus to be used in event equation.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_CLKSWITCH_RDY</name>
                  <value>63</value>
                  <description>EVSTAT3.AUX_TIMER2_CLKSWITCH_RDY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DAC_HOLD_ACTIVE</name>
                  <value>62</value>
                  <description>EVSTAT3.AUX_DAC_HOLD_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>61</value>
                  <description>EVSTAT3.AUX_SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>60</value>
                  <description>EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>59</value>
                  <description>EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>58</value>
                  <description>EVSTAT3.AUX_ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>57</value>
                  <description>EVSTAT3.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ISRC_RESET_N</name>
                  <value>56</value>
                  <description>EVSTAT3.AUX_ISRC_RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>55</value>
                  <description>EVSTAT3.AUX_TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>54</value>
                  <description>EVSTAT3.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV</name>
                  <value>53</value>
                  <description>EVSTAT3.AUX_TIMER1_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>52</value>
                  <description>EVSTAT3.AUX_TIMER2_PULSE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>51</value>
                  <description>EVSTAT3.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>50</value>
                  <description>EVSTAT3.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>49</value>
                  <description>EVSTAT3.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>48</value>
                  <description>EVSTAT3.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>47</value>
                  <description>EVSTAT2.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>46</value>
                  <description>EVSTAT2.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX1</name>
                  <value>45</value>
                  <description>EVSTAT2.MCU_OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX0</name>
                  <value>44</value>
                  <description>EVSTAT2.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>43</value>
                  <description>EVSTAT2.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>42</value>
                  <description>EVSTAT2.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_RECHARGE</name>
                  <value>41</value>
                  <description>EVSTAT2.VDDR_RECHARGE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_ACTIVE</name>
                  <value>40</value>
                  <description>EVSTAT2.MCU_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_DWN</name>
                  <value>39</value>
                  <description>EVSTAT2.PWR_DWN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>38</value>
                  <description>EVSTAT2.SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_TEMP_UPD</name>
                  <value>37</value>
                  <description>EVSTAT2.AON_BATMON_TEMP_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_BAT_UPD</name>
                  <value>36</value>
                  <description>EVSTAT2.AON_BATMON_BAT_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_4KHZ</name>
                  <value>35</value>
                  <description>EVSTAT2.AON_RTC_4KHZ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>34</value>
                  <description>EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>33</value>
                  <description>EVSTAT2.AON_RTC_CH2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_PROG_DLY_IDLE</name>
                  <value>32</value>
                  <description>Programmable delay event as described in PROGDLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO31</name>
                  <value>31</value>
                  <description>EVSTAT1.AUXIO31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO30</name>
                  <value>30</value>
                  <description>EVSTAT1.AUXIO30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO29</name>
                  <value>29</value>
                  <description>EVSTAT1.AUXIO29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO28</name>
                  <value>28</value>
                  <description>EVSTAT1.AUXIO28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO27</name>
                  <value>27</value>
                  <description>EVSTAT1.AUXIO27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO26</name>
                  <value>26</value>
                  <description>EVSTAT1.AUXIO26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO25</name>
                  <value>25</value>
                  <description>EVSTAT1.AUXIO25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO24</name>
                  <value>24</value>
                  <description>EVSTAT1.AUXIO24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO23</name>
                  <value>23</value>
                  <description>EVSTAT1.AUXIO23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO22</name>
                  <value>22</value>
                  <description>EVSTAT1.AUXIO22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO21</name>
                  <value>21</value>
                  <description>EVSTAT1.AUXIO21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO20</name>
                  <value>20</value>
                  <description>EVSTAT1.AUXIO20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO19</name>
                  <value>19</value>
                  <description>EVSTAT1.AUXIO19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO18</name>
                  <value>18</value>
                  <description>EVSTAT1.AUXIO18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO17</name>
                  <value>17</value>
                  <description>EVSTAT1.AUXIO17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO16</name>
                  <value>16</value>
                  <description>EVSTAT1.AUXIO16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>15</value>
                  <description>EVSTAT0.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>14</value>
                  <description>EVSTAT0.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>13</value>
                  <description>EVSTAT0.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>12</value>
                  <description>EVSTAT0.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>11</value>
                  <description>EVSTAT0.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>10</value>
                  <description>EVSTAT0.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>9</value>
                  <description>EVSTAT0.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>8</value>
                  <description>EVSTAT0.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>7</value>
                  <description>EVSTAT0.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>6</value>
                  <description>EVSTAT0.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>5</value>
                  <description>EVSTAT0.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>4</value>
                  <description>EVSTAT0.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>3</value>
                  <description>EVSTAT0.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>2</value>
                  <description>EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>1</value>
                  <description>EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>0</value>
                  <description>EVSTAT0.AUXIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCEWEVCFG1</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Sensor Controller Engine Wait Event Configuration 1

