btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Write VALUE to initialize bits 39:32 of accumulator.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SCE</name>
      <baseAddress>0x400E1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Sensor Control Engine (AUX_SCE) is a RISC-style microprocessor with separate fetch and execution cycles. It is optimized for low power and simple operations.  AUX_SCE code and data segments are stored in AUX_RAM. AON_PMCTL:AUXSCECLK sets the operational frequency.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FORCE_EV_LOW</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>FORCE_EV_HIGH</name>
              <description>[23:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESET_VECTOR</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DBG_FREEZE_EN</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>FORCE_WU_LOW</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>FORCE_WU_HIGH</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESTART</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>SINGLE_STEP</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FETCHSTAT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>PC</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CPUSTAT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>BUS_ERROR</name>
              <description>[11:11] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>SLEEP</name>
              <description>[10:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>WEV</name>
              <description>[9:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>HALTED</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED4</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>V_FLAG</name>
              <description>[3:3] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>C_FLAG</name>
              <description>[2:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>N_FLAG</name>
              <description>[1:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>Z_FLAG</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>WUSTAT</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:19] Internal. Only to be used through TI provided API.</description>
              <bitWidth>13</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>EXC_VECTOR</name>
              <description>[18:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[15:9] Internal. Only to be used through TI provided API.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>WU_SIGNAL</name>
              <description>[8:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>EV_SIGNALS</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCEWEV_PROG</name>
                  <value>128</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>64</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER1_EV_OR_IDLE</name>
                  <value>32</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV_OR_IDLE</name>
                  <value>16</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>8</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>4</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_PROG_DLY_IDLE</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REG1_0</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>REG1</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>REG0</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REG3_2</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>REG3</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>REG2</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REG5_4</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>REG5</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>REG4</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>REG7_6</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>REG7</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>REG6</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LOOPADDR</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>STOP</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>START</name>
              <description>[15:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LOOPCNT</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ITER_LEFT</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
