btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Write DATA to start transfer, MSB first. When transfer completes, MOSI stays at the value of LSB.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TX16</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Transmit 16 Bit

Write operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] 16 bit data transfer.

Write DATA to start transfer, MSB first. When transfer completes, MOSI stays at the value of LSB.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RX8</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Receive 8 Bit

Read operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[7:0] Latest 8 bits received on MISO.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RX16</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Receive 16 Bit

Read operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] Latest 16 bits received on MISO.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SCLKIDLE</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>SCLK Idle

Read operation stalls until SCLK is idle with no remaining clock edges.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Wait for SCLK idle.

Read operation stalls until SCLK is idle with no remaining clock edges. Read then returns 1.

AUX_SCE can use this to control CS deassertion.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>DATAIDLE</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Data Idle

Read operation stalls until current transfer completes.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Wait for data idle.

Read operation stalls until the SCLK period associated with LSB transmission completes. Read then returns 1.

AUX_SCE can use this to control CS deassertion.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SYSIF</name>
      <baseAddress>0x400C6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX System Interface (AUX_SYSIF) is responsible for:
- system resource requests, such as power supply, clock and, wakeup requests.
- configuration of AUX peripheral operational rates for AUX_SPIM, AUX_MAC, AUX_ANAIF DAC state machine and AUX_TIMER01. 
- configuration of event synchronization rate for AUX_EVCTL:EVSTAT2 and AUX_EVCTL:EVSTAT3.
- configuration of AUX_SCE wakeup vectors that trigger AUX_SCE execution from sleep.

Peripheral operational rate for AUX modules mentioned above can either be:
- SCE rate, which is configured in AON_PMCTL:AUXSCECLK.
- AUX bus rate, which equals SCE rate or SCLK_HF divided by two when MCU domain is active or AUX operational mode is active.

AUX_SYSIF also interfaces AON_RTC and AON_BATMON to enable read access to data and sub-second increment control of AON_RTC.</description>
      <registers>
        <register>
          <name>OPMODEREQ</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Operational Mode Request

AUX can operate in three operational modes. Each mode is associated with:
- a SCE clock source or rate, given by AON_PMCTL:AUXSCECLK. This rate is termed SCE_RATE. 
- a system power supply state request. AUX can request powerdown (uLDO) or active (GLDO or DCDC) system power supply state.
- a specific system response to an active AUX wakeup flag. The response is dependent on what operational mode is requested. 

uLDO power supply state offers limited current supply. AUX_SCE cannot use certain peripherals and functions such as AUX_DDI0_OSC, AUX_TDC and AUX_ANAIF ADC interface in this power supply state. 

Follow these rules:
- It is not allowed to change a request until it has been acknowledged through OPMODEACK.
- A change in mode request must happen stepwise along this sequence, the direction is irrelevant:
   PDA - A - LP - PDLP.

Failure to follow these rules might result in unexpected behavior and must be avoided.</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[1:0] AUX operational mode request.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDLP</name>
                  <value>3</value>
                  <description>Powerdown operational mode with wakeup to lowpower mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag overrides the operational mode externally to lowpower (LP) as long as the flag is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDA</name>
                  <value>2</value>
                  <description>Powerdown operational mode with wakeup to active mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- AON_PMCTL:AUXSCECLK.PD_SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag overrides the operational mode externally to active (A) as long as the flag is set.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <value>1</value>
                  <description>Lowpower operational mode, characterized by:
- Powerdown system power supply state (uLDO) request.
- SCE clock frequency (SCE_RATE) equals SCLK_MF.
- An active wakeup flag does not change operational mode.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <value>0</value>
                  <description>Active operational mode, characterized by:
- Active system power supply state (GLDO or DCDC) request. 
- AON_PMCTL:AUXSCECLK.SRC sets the SCE clock frequency (SCE_RATE).
- An active wakeup flag does not change operational mode.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OPMODEACK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Operational Mode Acknowledgement

