btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
The wakeup flag becomes edge sensitive if you write PROG_WU0 to 0 when PROGWU0CFG.EN is 1.
The wakeup flag becomes level sensitive if you write PROG_WU0 to 0 when PROGWU0CFG.EN is 0, then set PROGWU0CFG.EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xF</resetValue>
        </register>
        <register>
          <name>WUGATE</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Wakeup Gate

You must disable the AUX wakeup output:
- Before you clear a programmable wakeup flag.
- Before you change the value of [PROGWUnCFG.EN] or [PROGWUnCFG.WU_SRC].

The AUX wakeup output must be re-enabled after clear operation or programmable wakeup configuration.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Wakeup output enable.

0: Disable AUX wakeup output.
1: Enable AUX wakeup output.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG0</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Vector Configuration 0

AUX_SCE wakeup vector 0 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 0.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG1</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Vector Configuration 1

AUX_SCE wakeup vector 1 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 1.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG2</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Vector Configuration 2

AUX_SCE wakeup vector 2 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 2.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG3</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Vector Configuration 3

AUX_SCE wakeup vector 3 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 3.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG4</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Vector Configuration 4

AUX_SCE wakeup vector 4 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 4.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG5</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Vector Configuration 5

AUX_SCE wakeup vector 5 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 5.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG6</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Vector Configuration 6

AUX_SCE wakeup vector 6 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 6.

Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VECCFG7</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Vector Configuration 7

AUX_SCE wakeup vector 7 configuration</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VEC_EV</name>
              <description>[3:0] Select trigger event for vector 7.

