btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Non-enumerated values are treated as NONE.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU3</name>
                  <value>8</value>
                  <description>WUFLAGS.SW_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU2</name>
                  <value>7</value>
                  <description>WUFLAGS.SW_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU1</name>
                  <value>6</value>
                  <description>WUFLAGS.SW_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_WU0</name>
                  <value>5</value>
                  <description>WUFLAGS.SW_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU3</name>
                  <value>4</value>
                  <description>WUFLAGS.PROG_WU3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU2</name>
                  <value>3</value>
                  <description>WUFLAGS.PROG_WU2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU1</name>
                  <value>2</value>
                  <description>WUFLAGS.PROG_WU1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_WU0</name>
                  <value>1</value>
                  <description>WUFLAGS.PROG_WU0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Vector is disabled.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVSYNCRATE</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Event Synchronization Rate 

Configure synchronization rate for certain events to the synchronous AUX event bus.

You must select SCE rate when AUX_SCE uses the event. You must select AUX bus rate when system CPU uses the event.

SCE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by two when MCU domain is active.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_COMPA_SYNC_RATE</name>
              <description>[2:2] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPA event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_COMPB_SYNC_RATE</name>
              <description>[1:1] Select synchronization rate for AUX_EVCTL:EVSTAT2.AUX_COMPB event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUX_TIMER2_SYNC_RATE</name>
              <description>[0:0] Select synchronization rate for:
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3
- AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PEROPRATE</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Peripheral Operational Rate 

Some AUX peripherals are operated at either SCE or at AUX bus rate. 

You must select SCE rate when AUX_SCE uses such peripheral or an event produced by it. You must select AUX bus rate when system CPU uses such peripheral.

SCE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by 2 when MCU domain is active.</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>ANAIF_DAC_OP_RATE</name>
              <description>[3:3] Select operational rate for AUX_ANAIF DAC sample clock state machine.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER01_OP_RATE</name>
              <description>[2:2] Select operational rate for AUX_TIMER01.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIM_OP_RATE</name>
              <description>[1:1] Select operational rate for AUX_SPIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAC_OP_RATE</name>
              <description>[0:0] Select operational rate for AUX_MAC.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUS_RATE</name>
                  <value>1</value>
                  <description>AUX bus rate</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_RATE</name>
                  <value>0</value>
                  <description>SCE rate</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCCLKCTL</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>ADC Clock Control</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ACK</name>
              <description>[1:1] Clock acknowledgement.

0: ADC clock is disabled.
1: ADC clock is enabled.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>REQ</name>
              <description>[0:0] ADC clock request.

