btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Debug register</description>
          <fields>
            <field>
              <name>RESERVED4</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>PROGDLY</name>
              <description>[3:3] Halt programmable delay.

0: AUX_EVCTL:PROGDLY.VALUE decrements as normal.
1: Halt AUX_EVCTL:PROGDLY.VALUE decrementation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER2</name>
              <description>[2:2] Halt AUX_TIMER2.

0: AUX_TIMER2 operates as normal.
1: Halt AUX_TIMER2 operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER1</name>
              <description>[1:1] Halt AUX_TIMER01 Timer 1.

0: AUX_TIMER01 Timer 1 operates as normal.
1: Halt AUX_TIMER01 Timer 1 operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>AUX_TIMER0</name>
              <description>[0:0] Halt AUX_TIMER01 Timer 0.

0: AUX_TIMER01 Timer 0 operates as normal.
1: Halt AUX_TIMER01 Timer 0 operation.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TIMER2BRIDGE</name>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <description>AUX_TIMER2 Bridge</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>BUSY</name>
              <description>[0:0] Status of bus transactions to AUX_TIMER2.

0: No unfinished bus transactions.
1: A bus transaction is ongoing.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SWPWRPROF</name>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <description>Software Power Profiler</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[2:0] Software status bits that can be read by the power profiler.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TDC</name>
      <baseAddress>0x400C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>AUX Time To Digital Converter (AUX_TDC) is used to measure the time between two events with high resolution. 

AUX_TDC consists of a state machine that operates at AUX bus rate and an asynchronous fast-counter which is clocked by the TDC clock. DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL configures TDC clock source. The fast-counter counts on both edges of the TDC clock to double the resolution.

See the Technical Reference Manual for event timing requirements.</description>
      <registers>
        <register>
          <name>CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CMD</name>
              <description>[1:0] TDC commands.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ABORT</name>
                  <value>3</value>
                  <description>Force TDC state machine back to IDLE state.

Never write this command while AUX_TDC:STAT.STATE equals CLR_CNT or WAIT_CLR_CNT_DONE.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <value>2</value>
                  <description>Asynchronous counter start.

The counter starts to count when the start event is high. To achieve precise edge-to-edge measurements you must ensure that the start event is low for at least 420 ns after you write this command.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_SYNC_START</name>
                  <value>1</value>
                  <description>Synchronous counter start.

The counter looks for the opposite edge of the selected start event before it starts to count when the selected edge occurs. This guarantees an edge-triggered start and is recommended for frequency measurements.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_RESULT</name>
                  <value>0</value>
                  <description>Clear STAT.SAT, STAT.DONE, and RESULT.VALUE. 

This is not needed as prerequisite for a measurement. Reliable clear is only guaranteed from IDLE state.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STAT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Status</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SAT</name>
              <description>[7:7] TDC measurement saturation flag.

0: Conversion has not saturated.
1: Conversion stopped due to saturation.

This field is cleared when a new measurement is started or when CLR_RESULT is written to CTL.CMD.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>DONE</name>
              <description>[6:6] TDC measurement complete flag.

0: TDC measurement has not yet completed.
1: TDC measurement has completed.

This field clears when a new TDC measurement starts or when you write CLR_RESULT to CTL.CMD.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>STATE</name>
              <description>[5:0] TDC state machine status.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_STOP</name>
                  <value>46</value>
                  <description>Current state is TDC_FORCESTOP.
You wrote ABORT to CTL.CMD to abort the TDC measurement.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_FALL</name>
                  <value>30</value>
                  <description>Current state is TDC_WAIT_STARTFALL. 
The fast-counter circuit waits for a falling edge on the start event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_CLR_CNT_DONE</name>
                  <value>22</value>
                  <description>Current state is TDC_STATE_WAIT_CLRCNT_DONE. 
The state machine waits for fast-counter circuit to finish reset.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR</name>
                  <value>15</value>
                  <description>Current state is TDC_STATE_POR. 
This is the reset state.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GET_RESULT</name>
                  <value>14</value>
                  <description>Current state is TDC_STATE_GETRESULTS.
The state machine copies the counter value from the fast-counter circuit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP_CNTDWN</name>
                  <value>12</value>
                  <description>Current state is TDC_STATE_WAIT_STOPCNTDOWN.
The fast-counter circuit looks for the stop condition. It will ignore a number of stop events configured in TRIGCNTLOAD.CNT.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_STOP</name>
                  <value>8</value>
                  <description>Current state is TDC_STATE_WAIT_STOP.
The state machine waits for the fast-counter circuit to stop.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_CNT</name>
                  <value>7</value>
                  <description>Current state is TDC_STATE_CLRCNT. The fast-counter circuit is reset.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE</name>
                  <value>6</value>
                  <description>Current state is TDC_STATE_IDLE. 
This is the default state after reset and abortion. State will change when you write CTL.CMD to either RUN_SYNC_START or RUN.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START_STOP_CNT_EN</name>
                  <value>4</value>
                  <description>Current state is TDC_STATE_WAIT_STARTSTOPCNTEN.
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT_START</name>
                  <value>0</value>
                  <description>Current state is TDC_STATE_WAIT_START. 
The fast-counter circuit looks for the start condition. The state machine waits for the fast-counter to increment.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6</resetValue>
        </register>
        <register>
          <name>RESULT</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Result

