btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
The timer restarts from 0 when you set MODE to UP_ONCE, UP_PER, or UPDWN_PER.  

When you write MODE all internally queued updates to [CHnCC.*] and TARGET clear.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDWN_PER</name>
                  <value>3</value>
                  <description>Count up and down periodically. The timer counts from 0 to target value and back to 0, repeatedly.

Period =  (target value * 2) * timer clock period</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP_PER</name>
                  <value>2</value>
                  <description>Count up periodically. The timer increments from 0 to target value, repeatedly.

Period = (target value + 1) * timer clock period</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP_ONCE</name>
                  <value>1</value>
                  <description>Count up once. The timer increments from 0 to target value,  then stops and sets MODE to DIS.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0</value>
                  <description>Disable timer. Updates to counter, channels, and events stop.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TARGET</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Target

User defined counter target.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] 16 bit user defined counter target value, which is used when selected by CTL.TARGET_EN.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHDWTARGET</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Shadow Target</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Target value for next counter period.

The timer copies VALUE to TARGET.VALUE when CNTR.VALUE becomes 0. The copy does not happen when you restart the timer.

This is useful to avoid period jitter in PWM applications with time-varying period, sometimes referenced as phase corrected PWM.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CNTR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Counter</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] 16 bit current counter value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PRECFG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Clock Prescaler Configuration</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>[7:0] Clock division.

CLKDIV determines the timer clock frequency for counter, synchronization, and timer event updates. The timer clock frequency is the clock selected by AUX_SYSIF:TIMER2CLKCTL.SRC divided by (CLKDIV + 1). This inverse is the timer clock period.

0x00: Divide by 1.
0x01: Divide by 2.
... 
0xFF: Divide by 256.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>EVCTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Event Control 

Set and clear individual events manually. Manual update of an event takes priority over automatic channel updates to the same event. You cannot set and clear an event at the same time, such requests will be neglected.

An event can be automatically cleared, set, toggled, or pulsed by each channel, listed in decreasing order of priority. The action with highest priority happens when multiple channels want to update an event at the same time.

