btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Channel function sequence: 
- Set enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH2CC.VALUE = CNTR.VALUE.

Set CTL.MODE to UP_PER for edge-aligned PWM generation. Duty cycle is given by: 

When CH2CC.VALUE &lt;= TARGET.VALUE: 
   Duty cycle = CH2CC.VALUE / ( TARGET.VALUE + 1 ).

When CH2CC.VALUE > TARGET.VALUE: 
   Duty cycle = 1.

Enabled events are cleared when CH2CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_0_TGL_ON_CMP</name>
                  <value>10</value>
                  <description>Clear on zero, toggle on compare repeatedly.
 
Channel function sequence: 
- Clear enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH2CC.VALUE = CNTR.VALUE.

Set CTL.MODE to UPDWN_PER for center-aligned PWM generation. Duty cycle is given by: 

When CH2CC.VALUE &lt;= TARGET.VALUE: 
   Duty cycle = 1 - ( CH2CC.VALUE / TARGET.VALUE ).

When CH2CC.VALUE > TARGET.VALUE: 
   Duty cycle = 0.

Enabled events are set when CH2CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CAPT</name>
                  <value>9</value>
                  <description>Set on capture repeatedly.

Channel function sequence: 
- Set enabled events on capture event and copy CNTR.VALUE to CH2CC.VALUE.

Primary use scenario is to select this function before you start the timer.
Follow these steps if you need to select this function while CTL.MODE is different from DIS: 
 - Select this function with no event enable.
 - Configure CH2CCFG (optional).
 - Wait for three timer clock periods as defined in PRECFG before you enable events.

These steps prevent capture events caused by expired signal values in edge-detection circuit.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER_PULSE_WIDTH_MEAS</name>
                  <value>8</value>
                  <description>Period and pulse width measurement.

Continuously capture period and pulse width of the signal selected by CH2CCFG.CAPT_SRC relative to the signal edge given by CH2CCFG.EDGE. 

Set enabled events when CH2CC.VALUE contains signal period and CH2PCC.VALUE contains signal pulse width. 

Notes: 
- Make sure that you configure CH2CCFG.CAPT_SRC and CCACT when CTL.MODE equals DIS, then set CTL.MODE to UP_ONCE or UP_PER. 
- The counter restarts in the selected timer mode when CH2CC.VALUE contains the signal period.
- If more than one channel uses this function, the channels will perform this function one at a time. The channel with lowest number has priority and performs the function first. Next measurement starts when current measurement completes successfully or times out. A timeout occurs when counter equals target. 
- If you want to observe a timeout event configure another channel to SET_ON_CAPT.

Signal property requirements:
- Signal Period >= 2 * ( 1 + PRECFG.CLKDIV ) * timer clock period.
- Signal Period &lt;= 65535 * (1 + PRECFG.CLKDIV ) * timer clock period.
- Signal low and high phase >= (1 + PRECFG.CLKDIV ) * timer clock period.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ON_CMP_DIS</name>
                  <value>7</value>
                  <description>Pulse on compare, and then disable channel.

Channel function sequence: 
- Pulse enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.

 The event is high for two timer clock periods.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TGL_ON_CMP_DIS</name>
                  <value>6</value>
                  <description>Toggle on compare, and then disable channel.

Channel function sequence: 
- Toggle enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CMP_DIS</name>
                  <value>5</value>
                  <description>Set on compare, and then disable channel.

Channel function sequence: 
- Set enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_CMP_DIS</name>
                  <value>4</value>
                  <description>Clear on compare, and then disable channel.

Channel function sequence: 
- Clear enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_0_TGL_ON_CMP_DIS</name>
                  <value>3</value>
                  <description>Set on zero, toggle on compare, and then disable channel.

Channel function sequence: 
- Set enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.

Enabled events are cleared when CH2CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_ON_0_TGL_ON_CMP_DIS</name>
                  <value>2</value>
                  <description>Clear on zero, toggle on compare, and then disable channel.

Channel function sequence: 
- Clear enabled events when CNTR.VALUE = 0.
- Toggle enabled events when CH2CC.VALUE = CNTR.VALUE.
- Disable channel.

Enabled events are set when CH2CC.VALUE = 0 and CNTR.VALUE = 0.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_ON_CAPT_DIS</name>
                  <value>1</value>
                  <description>Set on capture, and then disable channel.

Channel function sequence: 
- Set enabled events on capture event and copy CNTR.VALUE to CH2CC.VALUE.
- Disable channel. 

Primary use scenario is to select this function before you start the timer.
Follow these steps if you need to select this function while CTL.MODE is different from DIS: 
 - Set to SET_ON_CAPT with no event enable.
 - Configure CH2CCFG (optional).
 - Wait for three timer clock periods as defined in PRECFG before you set to SET_ON_CAPT_DIS. Event enable is optional.

