btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
        <register>
          <name>ID_MMFR0</name>
          <addressOffset>0xd50</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 0
General information on the memory model and memory management support.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x100030</resetValue>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <addressOffset>0xd54</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 1
General information on the memory model and memory management support.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <addressOffset>0xd58</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 2
General information on the memory model and memory management support.</description>
          <fields>
            <field>
              <name>RESERVED28</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>WAIT_FOR_INTERRUPT_STALLING</name>
              <description>[24:24] wait for interrupt stalling

0x0: Not supported
0x1: Wait for interrupt supported</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[23:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1000000</resetValue>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <addressOffset>0xd5c</addressOffset>
          <size>32</size>
          <description>Memory Model Feature 3
General information on the memory model and memory management support.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ID_ISAR0</name>
          <addressOffset>0xd60</addressOffset>
          <size>32</size>
          <description>ISA Feature 0
Information on the instruction set attributes register</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1141110</resetValue>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <addressOffset>0xd64</addressOffset>
          <size>32</size>
          <description>ISA Feature 1
Information on the instruction set attributes register</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2112000</resetValue>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <addressOffset>0xd68</addressOffset>
          <size>32</size>
          <description>ISA Feature 2
Information on the instruction set attributes register</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x21232231</resetValue>
        </register>
        <register>
          <name>ID_ISAR3</name>
          <addressOffset>0xd6c</addressOffset>
          <size>32</size>
          <description>ISA Feature 3
Information on the instruction set attributes register</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1111131</resetValue>
        </register>
        <register>
          <name>ID_ISAR4</name>
          <addressOffset>0xd70</addressOffset>
          <size>32</size>
          <description>ISA Feature 4
Information on the instruction set attributes register</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1310102</resetValue>
        </register>
        <register>
          <name>CPACR</name>
          <addressOffset>0xd88</addressOffset>
          <size>32</size>
          <description>Coprocessor Access Control
This register specifies the access privileges for coprocessors.</description>
          <fields>
            <field>
              <name>RESERVED0</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <addressOffset>0xd90</addressOffset>
          <size>32</size>
          <description>MPU Type
This register indicates many regions the MPU supports.</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Reads 0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IREGION</name>
              <description>[23:16] The processor core uses only a unified MPU, this field always reads 0x0.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DREGION</name>
              <description>[15:8] Number of supported MPU regions field. This field reads 0x08 indicating eight MPU regions.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Reads 0.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>SEPARATE</name>
              <description>[0:0] The processor core uses only a unified MPU, thus this field is always 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x800</resetValue>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <addressOffset>0xd94</addressOffset>
          <size>32</size>
          <description>MPU Control
This register is used to enable the MPU, enable the default memory map (background region), and enable the MPU when in Hard Fault, Non-maskable Interrupt (NMI), and FAULTMASK escalated handlers. When the MPU is enabled, at least one region of the memory map must be enabled for the MPU to function unless the PRIVDEFENA bit is set. If the PRIVDEFENA bit is set and no regions are enabled, then only privileged code can operate. When the MPU is disabled, the default address map is used, as if no MPU is present. When the MPU is enabled, only the system partition and vector table loads are always accessible. Other areas are accessible based on regions and whether PRIVDEFENA is enabled. Unless HFNMIENA is set, the MPU is not enabled when the exception priority is -1 or -2. These priorities are only possible when in Hard fault, NMI, or when FAULTMASK is enabled. The HFNMIENA bit enables the MPU when operating with these two priorities.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PRIVDEFENA</name>
              <description>[2:2] This bit enables the default memory map for privileged access, as a background region, when the MPU is enabled. The background region acts as if it was region number 1 before any settable regions. Any region that is set up overlays this default map, and overrides it. If this bit is not set, the default memory map is disabled, and memory not covered by a region faults. This applies to memory type, Execute Never (XN), cache and shareable rules. However, this only applies to privileged mode (fetch and data access). User mode code faults unless a region has been set up for its code and data. When the MPU is disabled, the default map acts on both privileged and user mode code. XN and SO rules always apply to the system partition whether this enable is set or not. If the MPU is disabled, this bit is ignored.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>[1:1] This bit enables the MPU when in Hard Fault, NMI, and FAULTMASK escalated handlers. If this bit and ENABLE are set, the MPU is enabled when in these handlers. If this bit is not set, the MPU is disabled when in these handlers, regardless of the value of ENABLE bit. If this bit is set and ENABLE is not set, behavior is unpredictable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Enable MPU

0: MPU disabled
1: MPU enabled</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RNR</name>
          <addressOffset>0xd98</addressOffset>
          <size>32</size>
          <description>MPU Region Number
This register is used to select which protection region is accessed. The following write to  MPU_RASR or MPU_RBAR configures the characteristics of the protection region that is selected by this register.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>REGION</name>
              <description>[7:0] Region select field. 
This field selects the region to operate on when using the MPU_RASR and MPU_RBAR. It must be written first except when the address MPU_RBAR.VALID and MPU_RBAR.REGION fields are written, which overwrites this.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RBAR</name>
          <addressOffset>0xd9c</addressOffset>
          <size>32</size>
          <description>MPU Region Base Address
This register writes the base address of a region. It also contains a REGION field that can be used to override MPU_RNR.REGION, if the VALID bit is set. This register sets the base for the region. It is aligned by the size. So, a 64-KB sized region must be aligned on a multiple of 64KB, for example, 0x00010000 or 0x00020000. The region always reads back as the current MPU region number. VALID always reads back as 0. Writing VALID = 1 and REGION = n changes the region number to n. This is a short-hand way to write the MPU_RNR. This register is unpredictable if accessed other than as a word.</description>
          <fields>
            <field>
              <name>ADDR</name>
              <description>[31:5] Region base address field. 
The position of the LSB depends on the region size, so that the base address is aligned according to an even multiple of size. The power of 2 size specified by the SZENABLE field of the MPU Region Attribute and Size Register defines how many bits of base address are used.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>VALID</name>
              <description>[4:4] MPU region number valid:
0: MPU_RNR remains unchanged and is interpreted.
1: MPU_RNR is overwritten by REGION.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>REGION</name>
              <description>[3:0] MPU region override field</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RASR</name>
          <addressOffset>0xda0</addressOffset>
          <size>32</size>
          <description>MPU Region Attribute and Size
This register controls the MPU access permissions. The register is made up of two part registers, each of halfword size. These can be accessed using the halfword size, or they can both be simultaneously accessed using a word operation. The sub-region disable bits are not supported for region sizes of 32 bytes, 64 bytes, and 128 bytes. When these region sizes are used, the subregion disable bits must be programmed as 0.</description>
          <fields>
            <field>
              <name>RESERVED29</name>
              <description>[31:29] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>XN</name>
              <description>[28:28] Instruction access disable:
0: Enable instruction fetches
1: Disable instruction fetches</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RESERVED27</name>
              <description>[27:27] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>AP</name>
              <description>[26:24] Data access permission:
0x0: Priviliged permissions: No access. User permissions: No access.
0x1: Priviliged permissions: Read-write. User permissions: No access.
0x2: Priviliged permissions: Read-write. User permissions: Read-only.
0x3: Priviliged permissions: Read-write. User permissions: Read-write.
0x4: Reserved
0x5: Priviliged permissions: Read-only. User permissions: No access.
0x6: Priviliged permissions: Read-only. User permissions: Read-only.
0x7: Priviliged permissions: Read-only. User permissions: Read-only.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED22</name>
              <description>[23:22] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>TEX</name>
              <description>[21:19] Type extension</description>
              <bitWidth>3</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>S</name>
              <description>[18:18] Shareable bit:
0: Not shareable
1: Shareable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>C</name>
              <description>[17:17] Cacheable bit:
0: Not cacheable
1: Cacheable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>B</name>
              <description>[16:16] Bufferable bit:
0: Not bufferable
1: Bufferable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SRD</name>
              <description>[15:8] Sub-Region Disable field:
Setting a bit in this field disables the corresponding sub-region. Regions are split into eight equal-sized sub-regions. Sub-regions are not supported for region sizes of 128 bytes and less.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[7:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SIZE</name>
              <description>[5:1] MPU Protection Region Size Field:
0x04: 32B
0x05: 64B
0x06: 128B
0x07: 256B
0x08: 512B
0x09: 1KB
0x0A: 2KB
0x0B: 4KB
0x0C: 8KB
0x0D: 16KB
0x0E: 32KB
0x0F: 64KB
0x10: 128KB
0x11: 256KB
0x12: 512KB
0x13: 1MB
0x14: 2MB
0x15: 4MB
0x16: 8MB
0x17: 16MB
0x18: 32MB
0x19: 64MB
0x1A: 128MB
0x1B: 256MB
0x1C: 512MB
0x1D: 1GB
0x1E: 2GB
0x1F: 4GB</description>
              <bitWidth>5</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ENABLE</name>
              <description>[0:0] Region enable bit:
0: Disable region 
1: Enable region</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RBAR_A1</name>
          <addressOffset>0xda4</addressOffset>
          <size>32</size>
          <description>MPU Alias 1 Region Base Address
Alias for MPU_RBAR</description>
          <fields>
            <field>
              <name>MPU_RBAR_A1</name>
              <description>[31:0] Alias for MPU_RBAR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RASR_A1</name>
          <addressOffset>0xda8</addressOffset>
          <size>32</size>
          <description>MPU Alias 1 Region Attribute and Size
Alias for MPU_RASR</description>
          <fields>
            <field>
              <name>MPU_RASR_A1</name>
              <description>[31:0] Alias for MPU_RASR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RBAR_A2</name>
          <addressOffset>0xdac</addressOffset>
          <size>32</size>
          <description>MPU Alias 2 Region Base Address
Alias for MPU_RBAR</description>
          <fields>
            <field>
              <name>MPU_RBAR_A2</name>
              <description>[31:0] Alias for MPU_RBAR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RASR_A2</name>
          <addressOffset>0xdb0</addressOffset>
          <size>32</size>
          <description>MPU Alias 2 Region Attribute and Size
Alias for MPU_RASR</description>
          <fields>
            <field>
              <name>MPU_RASR_A2</name>
              <description>[31:0] Alias for MPU_RASR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RBAR_A3</name>
          <addressOffset>0xdb4</addressOffset>
          <size>32</size>
          <description>MPU Alias 3 Region Base Address
Alias for MPU_RBAR</description>
          <fields>
            <field>
              <name>MPU_RBAR_A3</name>
              <description>[31:0] Alias for MPU_RBAR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MPU_RASR_A3</name>
          <addressOffset>0xdb8</addressOffset>
          <size>32</size>
          <description>MPU Alias 3 Region Attribute and Size
Alias for MPU_RASR</description>
          <fields>
            <field>
              <name>MPU_RASR_A3</name>
              <description>[31:0] Alias for MPU_RASR</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
