btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
0x00: R0
0x01: R1
0x02: R2
0x03: R3
0x04: R4
0x05: R5
0x06: R6
0x07: R7
0x08: R8
0x09: R9
0x0A: R10
0x0B: R11
0x0C: R12
0x0D: Current SP
0x0E: LR
0x0F: DebugReturnAddress
0x10: XPSR/flags, execution state information, and exception number
0x11: MSP (Main SP)
0x12: PSP (Process SP)
0x14: CONTROL&lt;&lt;24 | FAULTMASK&lt;&lt;16 | BASEPRI&lt;&lt;8 | PRIMASK</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DCRDR</name>
          <addressOffset>0xdf8</addressOffset>
          <size>32</size>
          <description>Debug Core Register Data</description>
          <fields>
            <field>
              <name>DCRDR</name>
              <description>[31:0] This register holds data for reading and writing registers to and from the processor. This is the data value written to the register selected by DCRSR. When the processor receives a request from DCRSR, this register is read or written by the processor using a normal load-store unit operation. If core register transfers are not being performed, software-based debug monitors can use this register for communication in non-halting debug. This enables flags and bits to acknowledge state and indicate if commands have been accepted to, replied to, or accepted and replied to.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DEMCR</name>
          <addressOffset>0xdfc</addressOffset>
          <size>32</size>
          <description>Debug Exception and Monitor Control
The purpose of this register is vector catching and debug monitor control.  This register manages exception behavior under debug. Vector catching is only available to halting debug. The upper halfword is for monitor controls and the lower halfword is for halting exception support. This register is not reset on a system reset. This register is reset by a power-on reset. The fields MON_EN, MON_PEND, MON_STEP and MON_REQ are always cleared on a core reset. The debug monitor is enabled by software in the reset handler or later, or by the **AHB-AP** port. Vector catching is semi-synchronous. When a matching event is seen, a Halt is requested. Because the processor can only halt on an instruction boundary, it must wait until the next instruction boundary. As a result, it stops on the first instruction of the exception handler. However, two special cases exist when a vector catch has triggered: 1. If a fault is taken during a vector read or stack push error the halt occurs on the corresponding fault handler for the vector error or stack push. 2. If a late arriving interrupt detected during a vector read or stack push error it is not taken. That is, an implementation that supports the late arrival optimization must suppress it in this case.</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>TRCENA</name>
              <description>[24:24] This bit must be set to 1 to enable use of the trace and debug blocks: DWT, ITM, ETM and TPIU. This enables control of power usage unless tracing is required. The application can enable this, for ITM use, or use by a debugger.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED20</name>
              <description>[23:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>[19:19] This enables the monitor to identify how it wakes up. This bit clears on a Core Reset.

0x0: Woken up by debug exception.
0x1: Woken up by MON_PEND</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>[18:18] When MON_EN = 1, this steps the core. When MON_EN = 0, this bit is ignored. 
This is the equivalent to DHCSR.C_STEP. Interrupts are only stepped according to the priority of the monitor and settings of PRIMASK, FAULTMASK, or BASEPRI.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>[17:17] Pend the monitor to activate when priority permits. This can wake up the monitor through the AHB-AP port. It is the equivalent to DHCSR.C_HALT for Monitor debug. This register does not reset on a system reset. It is only reset by a power-on reset. Software in the reset handler or later, or by the DAP must enable the debug monitor.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>MON_EN</name>
              <description>[16:16] Enable the debug monitor. 
When enabled, the System handler priority register controls its priority level. If disabled, then all debug events go to Hard fault. DHCSR.C_DEBUGEN overrides this bit. Vector catching is semi-synchronous. When a matching event is seen, a Halt is requested. Because the processor can only halt on an instruction boundary, it must wait until the next instruction boundary. As a result, it stops on the first instruction of the exception handler. However, two special cases exist when a vector catch has triggered: 1. If a fault is taken during vectoring, vector read or stack push error, the halt occurs on the corresponding fault handler, for the vector error or stack push. 2. If a late arriving interrupt comes in during vectoring, it is not taken. That is, an implementation that supports the late arrival optimization must suppress it in this case.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[15:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>[10:10] Debug trap on Hard Fault. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>[9:9] Debug trap on a fault occurring during an exception entry or return sequence. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>[8:8] Debug Trap on normal Bus error. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>[7:7] Debug trap on Usage Fault state errors. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>[6:6] Debug trap on Usage Fault enabled checking errors. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>[5:5] Debug trap on a UsageFault access to a Coprocessor. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>[4:4] Debug trap on Memory Management faults. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[3:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>VC_CORERESET</name>
              <description>[0:0] Reset Vector Catch. Halt running system if Core reset occurs. Ignored when DHCSR.C_DEBUGEN is cleared.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>STIR</name>
          <addressOffset>0xf00</addressOffset>
          <size>32</size>
          <description>Software Trigger Interrupt</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Write 0.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>INTID</name>
              <description>[8:0] Interrupt ID field. Writing a value to this bit-field is the same as manually pending an interrupt by setting the corresponding interrupt bit in an Interrupt Set Pending Register in NVIC_ISPR0 or NVIC_ISPR1.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPCCR</name>
          <addressOffset>0xf34</addressOffset>
          <size>32</size>
          <description>Floating Point Context Control
This register holds control data for the floating-point unit. Accessible only by privileged software.</description>
          <fields>
            <field>
              <name>ASPEN</name>
              <description>[31:31] Automatic State Preservation enable. 
When this bit is set is will cause bit [2] of the Special CONTROL register to be set (FPCA) on execution of a floating point instruction which results in the floating point state automatically being preserved on exception entry.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>LSPEN</name>
              <description>[30:30] Lazy State Preservation enable. 
Lazy state preservation is when the processor performs a context save, space on the stack is reserved for the floating point state but it is not stacked until the new context performs a floating point operation.
0: Disable automatic lazy state preservation for floating-point context.
1: Enable automatic lazy state preservation for floating-point context.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED9</name>
              <description>[29:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>MONRDY</name>
              <description>[8:8] Indicates whether the the software executing when the processor allocated the FP stack frame was able to set the DebugMonitor exception to pending.
0: DebugMonitor is disabled or priority did not permit setting DEMCR.MON_PEND when the floating-point stack frame was allocated.
1: DebugMonitor is enabled and priority permits setting DEMCR.MON_PEND when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>BFRDY</name>
              <description>[6:6] Indicates whether the software executing when the processor allocated the FP stack frame was able to set the BusFault exception to pending.
0: BusFault is disabled or priority did not permit setting the BusFault handler to the pending state when the floating-point stack frame was allocated. 
1: BusFault is enabled and priority permitted setting the BusFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MMRDY</name>
              <description>[5:5] Indicates whether the software executing when the processor allocated the FP stack frame was able to set the MemManage exception to pending.
0: MemManage is disabled or priority did not permit setting the MemManage handler to the pending state when the floating-point stack frame was allocated.
1: MemManage is enabled and priority permitted setting the MemManage handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>HFRDY</name>
              <description>[4:4] Indicates whether the software executing when the processor allocated the FP stack frame was able to set the HardFault exception to pending.
0: Priority did not permit setting the HardFault handler to the pending state when the floating-point stack frame was allocated.
1: Priority permitted setting the HardFault handler to the pending state when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>THREAD</name>
              <description>[3:3] Indicates the processor mode was Thread when it allocated the FP stack frame.
0: Mode was not Thread Mode when the floating-point stack frame was allocated.
1: Mode was Thread Mode when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[2:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>USER</name>
              <description>[1:1] Indicates the privilege level of the software executing was User (Unpriviledged) when the processor allocated the FP stack frame:
0: Privilege level was not user when the floating-point stack frame was allocated.
1: Privilege level was user when the floating-point stack frame was allocated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>LSPACT</name>
              <description>[0:0] Indicates whether Lazy preservation of the FP state is active:
0: Lazy state preservation is not active.
1: Lazy state preservation is active. floating-point stack frame has been allocated but saving state to it has been deferred.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC0000000</resetValue>
        </register>
        <register>
          <name>FPCAR</name>
          <addressOffset>0xf38</addressOffset>
          <size>32</size>
          <description>Floating-Point Context Address 
This register holds the location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>[31:2] Holds the (double-word-aligned) location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FPDSCR</name>
          <addressOffset>0xf3c</addressOffset>
          <size>32</size>
          <description>Floating Point Default Status Control
This register holds the default values for the floating-point status control data that the processor assigns to the FPSCR when it creates a new floating-point context. Accessible only by privileged software.</description>
          <fields>
            <field>
              <name>RESERVED27</name>
              <description>[31:27] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>AHP</name>
              <description>[26:26] Default value for Alternative Half Precision bit. (If this bit is set to 1 then Alternative half-precision format is selected).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>DN</name>
              <description>[25:25] Default value for Default NaN mode bit. (If this bit is set to 1 then any operation involving one or more NaNs returns the Default NaN).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>FZ</name>
              <description>[24:24] Default value for Flush-to-Zero mode bit. (If this bit is set to 1 then Flush-to-zero mode is enabled).</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RMODE</name>
              <description>[23:22] Default value for Rounding Mode control field. (The encoding for this field is:
0b00 Round to Nearest (RN) mode
0b01 Round towards Plus Infinity (RP) mode
0b10 Round towards Minus Infinity (RM) mode
0b11 Round towards Zero (RZ) mode.
The specified rounding mode is used by almost all floating-point instructions).</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[21:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MVFR0</name>
          <addressOffset>0xf40</addressOffset>
          <size>32</size>
          <description>Media and FP Feature 0
Describes the features provided by the Floating-point extension.</description>
          <fields>
            <field>
              <name>FP_ROUNDING_MODES</name>
              <description>[31:28] Indicates the rounding modes supported by the FP floating-point hardware. The value of this field is: 0b0001 - all rounding modes supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>SHORT_VECTORS</name>
              <description>[27:24] Indicates the hardware support for FP short vectors. The value of this field is: 0b0000 - not supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SQUARE_ROOT</name>
              <description>[23:20] Indicates the hardware support for FP square root operations. The value of this field is: 0b0001 - supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>[19:16] Indicates the hardware support for FP divide operations. The value of this field is: 0b0001 - supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>FP_EXCEPTION_TRAPPING</name>
              <description>[15:12] Indicates whether the FP hardware implementation supports exception trapping. The value of this field is: 0b0000 - not supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>DOUBLE_PRECISION</name>
              <description>[11:8] Indicates the hardware support for FP double-precision operations. The value of this field is: 0b0000 - not supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SINGLE_PRECISION</name>
              <description>[7:4] Indicates the hardware support for FP single-precision operations. The value of this field is: 0b0010 - supported.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>A_SIMD</name>
              <description>[3:0] Indicates the size of the FP register bank. The value of this field is: 0b0001 - supported, 16 x 64-bit registers.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x10110021</resetValue>
        </register>
