btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
        <register>
          <name>ANABYPASSVAL2</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>[13:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ATESTCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Analog Test Control</description>
          <fields>
            <field>
              <name>SCLK_LF_AUX_EN</name>
              <description>[31:31] Enable 32 kHz clock to AUX_COMPB.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[30:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>15</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TEST_RCOSCMF</name>
              <description>[15:14] Test mode control for RCOSC_MF

0x0:  test modes disabled
0x1:  boosted bias current into self biased inverter
0x2:  clock qualification disabled
0x3:  boosted bias current into self biased inverter + clock qualification disabled</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>ATEST_RCOSCMF</name>
              <description>[13:12] ATEST control for RCOSC_MF

0x0:  ATEST disabled
0x1:  ATEST enabled, VDD_LOCAL connected,  ATEST internal to **RCOSC_MF* enabled to send out 2MHz clock.
0x2:  ATEST disabled
0x3:  ATEST enabled, bias current connected, ATEST internal to **RCOSC_MF* enabled to send out 2MHz clock.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[11:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ADCDOUBLERNANOAMPCTL</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>ADC Doubler Nanoamp Control</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>NANOAMP_BIAS_ENABLE</name>
              <description>[24:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SPARE23</name>
              <description>[23:23] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
            </field>
            <field>
              <name>RESERVED6</name>
              <description>[22:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>[5:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>[4:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADC_IREF_CTRL</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>XOSCHFCTL</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>XOSCHF Control</description>
          <fields>
            <field>
              <name>SPARE14</name>
              <description>[31:14] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>TCXO_MODE_XOSC_HF_EN</name>
              <description>[13:13] If this register  is 1 when TCXO_MODE  is 1, then the XOSC_HF is enabled, turning on the XOSC_HF bias current allowing a DC bias point to be provided to the clipped-sine wave clock signal on external input.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>TCXO_MODE</name>
              <description>[12:12] If this register  is 1  when BYPASS is  1, this will enable clock qualification on the TCXO clock on external input.  This register has no effect when BYPASS is 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[11:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>BYPASS</name>
              <description>[6:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[5:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>[4:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>LFOSCCTL</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Low Frequency Oscillator Control</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>[23:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>[21:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RESERVED10</name>
              <description>[17:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>6P0MEG</name>
                  <value>3</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6P5MEG</name>
                  <value>2</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7P0MEG</name>
                  <value>1</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7P5MEG</name>
                  <value>0</value>
                  <description>Internal. Only to be used through TI provided API.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RCOSCHFCTL</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>RCOSCHF Control</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RCOSCHF_CTRIM</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RCOSCMFCTL</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>RCOSC_MF Control</description>
          <fields>
            <field>
              <name>SPARE16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RCOSC_MF_CAP_ARRAY</name>
              <description>[15:9] Adjust RCOSC_MF capacitor array.

0x0:  nominal frequency, 0.625pF
0x40:  highest frequency, 0.125pF
0x3F:  lowest frequency, 1.125pF</description>
              <bitWidth>7</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RCOSC_MF_REG_SEL</name>
              <description>[8:8] Choose regulator type.

0:  default
1:  alternate</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RCOSC_MF_RES_COARSE</name>
              <description>[7:6] Select coarse resistor for frequency adjustment.

0x0:  400kohms, default
0x1:  300kohms, min
0x2:  600kohms, max
0x3:  500kohms</description>
              <bitWidth>2</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RCOSC_MF_RES_FINE</name>
              <description>[5:4] Select fine resistor for frequency adjustment.

