btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EVENT</name>
      <baseAddress>0x40083000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Event Fabric Component Definition</description>
      <registers>
        <register>
          <name>CPUIRQSEL0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 0</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_GPIO_EDGE</name>
                  <value>4</value>
                  <description>Edge detect event from IOC. Configureded by the IOC:IOCFGn.EDGE_IRQ_EN and  IOC:IOCFGn.EDGE_DET settings</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x4</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 1</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C_IRQ</name>
                  <value>9</value>
                  <description>Interrupt event from I2C</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x9</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 2</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_CPE_1</name>
                  <value>30</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE1 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_1 event</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1E</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 3</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKA_IRQ</name>
                  <value>31</value>
                  <description>PKA Interrupt event</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1F</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 4</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_COMB</name>
                  <value>7</value>
                  <description>Event from AON_RTC, controlled by the AON_RTC:CTL.COMB_EV_MASK setting</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x7</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 5</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_COMB</name>
                  <value>36</value>
                  <description>UART0 combined interrupt, interrupt flags are found here UART0:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x24</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 6</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SWEV0</name>
                  <value>28</value>
                  <description>AUX software event 0, triggered by AUX_EVCTL:SWEVSET.SWEV0, also available as AUX_EVENT0 AON wake up event.
MCU domain wakeup control AON_EVENT:MCUWUSEL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1C</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 7</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI0_COMB</name>
                  <value>34</value>
                  <description>SSI0 combined interrupt, interrupt flags are found here SSI0:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x22</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL8</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 8</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1_COMB</name>
                  <value>35</value>
                  <description>SSI1 combined interrupt, interrupt flags are found here SSI1:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x23</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL9</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 9</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_CPE_0</name>
                  <value>27</value>
                  <description>Combined Interrupt for CPE Generated events. Corresponding flags are here RFC_DBELL:RFCPEIFG. Only interrupts selected with CPE0 in RFC_DBELL:RFCPEIFG can trigger a RFC_CPE_0 event</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1B</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL10</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 10</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_HW_COMB</name>
                  <value>26</value>
                  <description>Combined RFC hardware interrupt, corresponding flag is here RFC_DBELL:RFHWIFG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1A</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL11</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 11</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RFC_CMD_ACK</name>
                  <value>25</value>
                  <description>RFC Doorbell Command Acknowledgement Interrupt, equvialent to RFC_DBELL:RFACKIFG.ACKFLAG</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x19</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL12</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 12</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S_IRQ</name>
                  <value>8</value>
                  <description>Interrupt event from I2S</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x8</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL13</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 13</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_SWEV1</name>
                  <value>29</value>
                  <description>AUX software event 1, triggered by AUX_EVCTL:SWEVSET.SWEV1, also available as AUX_EVENT2 AON wake up event.
MCU domain wakeup control AON_EVENT:MCUWUSEL</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1D</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL14</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 14</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDT_IRQ</name>
                  <value>24</value>
                  <description>Watchdog interrupt event, controlled by WDT:CTL.INTEN</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x18</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL15</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 15</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0A</name>
                  <value>16</value>
                  <description>GPT0A interrupt event, controlled by GPT0:TAMR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x10</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 16</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0B</name>
                  <value>17</value>
                  <description>GPT0B interrupt event, controlled by GPT0:TBMR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x11</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL17</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 17</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1A</name>
                  <value>18</value>
                  <description>GPT1A interrupt event, controlled by GPT1:TAMR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x12</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL18</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 18</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1B</name>
                  <value>19</value>
                  <description>GPT1B interrupt event, controlled by GPT1:TBMR</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x13</resetValue>
        </register>
