btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
        <register>
          <name>RCOSC_HF_TEMPCOMP</name>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FINE_RESISTOR</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>CTRIM</name>
              <description>[23:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>CTRIMFRACT_QUAD</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CTRIMFRACT_SLOPE</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>ICEPICK_DEVICE_ID</name>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <description>IcePick Device Identification
Reading this register and the FCFG1:USER_ID register is the only supported way of identifying a device.</description>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>[31:28] Field used to distinguish revisions of the device.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>WAFER_ID</name>
              <description>[27:12] Field used to identify silicon die.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>MANUFACTURER_ID</name>
              <description>[11:0] Manufacturer code.

0x02F: Texas Instruments</description>
              <bitWidth>12</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3BB4102F</resetValue>
        </register>
        <register>
          <name>FCFG1_REVISION</name>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <description>Factory Configuration (FCFG1) Revision</description>
          <fields>
            <field>
              <name>REV</name>
              <description>[31:0] The revision number of the FCFG1 layout. This value will be read by application SW in order to determine which FCFG1 parameters that have valid values. This revision number must be incremented by 1 before any devices are to be produced if the FCFG1 layout has changed since the previous production of devices.
Value migth change without warning.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x28</resetValue>
        </register>
        <register>
          <name>MISC_OTP_DATA</name>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <description>Misc OTP Data</description>
          <fields>
            <field>
              <name>RCOSC_HF_ITUNE</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>RCOSC_HF_CRIM</name>
              <description>[27:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>PER_M</name>
              <description>[19:15] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>PER_E</name>
              <description>[14:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RESERVED</name>
              <description>[11:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>TEST_PROGRAM_REV</name>
              <description>[7:0] The revision of the test program used in the production process when FCFG1 was programmed.
Value migth change without warning.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xCF00</resetValue>
        </register>
        <register>
          <name>IOCONF</name>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <description>IO Configuration</description>
          <fields>
            <field>
              <name>RESERVED7</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>GPIO_CNT</name>
              <description>[6:0] Number of available DIOs.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFFF00</resetValue>
        </register>
        <register>
          <name>CONFIG_IF_ADC</name>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>FF2ADJ</name>
              <description>[31:28] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>FF3ADJ</name>
              <description>[27:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>INT3ADJ</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>FF1ADJ</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>AAFCAP</name>
              <description>[15:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>INT2ADJ</name>
              <description>[13:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>IFDIGLDO_TRIM_OUTPUT</name>
              <description>[9:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>IFANALDO_TRIM_OUTPUT</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3460F400</resetValue>
        </register>
        <register>
          <name>CONFIG_OSC_TOP</name>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>[29:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>[25:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>[9:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xDC07FC00</resetValue>
        </register>
        <register>
          <name>SOC_ADC_ABS_GAIN</name>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <description>AUX_ADC Gain in Absolute Reference Mode</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SOC_ADC_ABS_GAIN_TEMP1</name>
              <description>[15:0] SOC_ADC gain in absolute reference mode at temperature 1 (30C). Calculated in production test..</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_REL_GAIN</name>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <description>AUX_ADC Gain in Relative Reference Mode</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SOC_ADC_REL_GAIN_TEMP1</name>
              <description>[15:0] SOC_ADC gain in relative reference mode at temperature 1 (30C). Calculated in production test..</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_OFFSET_INT</name>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <description>AUX_ADC Temperature Offsets in Absolute Reference Mode</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>SOC_ADC_REL_OFFSET_TEMP1</name>
              <description>[23:16] SOC_ADC offset in relative reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED8</name>
              <description>[15:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SOC_ADC_ABS_OFFSET_TEMP1</name>
              <description>[7:0] SOC_ADC offset in absolute reference mode at temperature 1 (30C). Signed 8-bit number. Calculated in production test..</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</name>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC080</resetValue>
        </register>
        <register>
          <name>AMPCOMP_TH1</name>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>[9:6] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>[5:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFF7B828E</resetValue>
        </register>
        <register>
          <name>AMPCOMP_TH2</name>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>[31:26] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>26</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[25:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LPMUPDATE_HTM</name>
              <description>[23:18] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[17:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>[15:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[9:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>[7:2] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[1:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x6B8B0303</resetValue>
        </register>
        <register>
          <name>AMPCOMP_CTRL1</name>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:31] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
            </field>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>[30:30] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[29:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>[23:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>[19:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>[7:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFF483F47</resetValue>
        </register>
        <register>
          <name>ANABYPASS_VALUE2</name>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:14] Internal. Only to be used through TI provided API.</description>
              <bitWidth>18</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>[13:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>14</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xFFFFC3FF</resetValue>
        </register>
