btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Can be forced on by UARTCLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_UART1</name>
                  <value>2</value>
                  <description>Enable clock for UART1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AM_UART0</name>
                  <value>1</value>
                  <description>Enable clock for UART0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SSICLKGR</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>SSI Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED10</name>
              <description>[31:10] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>22</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[9:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  SSICLKGS.CLK_EN and  SSICLKGDS.CLK_EN when enabled.

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <value>2</value>
                  <description>Enable clock for SSI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <value>1</value>
                  <description>Enable clock for SSI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[7:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <value>2</value>
                  <description>Enable clock for SSI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <value>1</value>
                  <description>Enable clock for SSI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SSICLKGS</name>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <description>SSI Clock Gate For Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by SSICLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <value>2</value>
                  <description>Enable clock for SSI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <value>1</value>
                  <description>Enable clock for SSI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SSICLKGDS</name>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <description>SSI Clock Gate For Deep Sleep Mode</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>[1:0] 0: Disable clock
1: Enable clock

Can be forced on by SSICLKGR.AM_CLK_EN

For changes to take effect, CLKLOADCTL.LOAD needs to be written</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI1</name>
                  <value>2</value>
                  <description>Enable clock for SSI1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI0</name>
                  <value>1</value>
                  <description>Enable clock for SSI0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>I2SCLKGR</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>I2S Clock Gate For Run And All Modes</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>AM_CLK_EN</name>
              <description>[8:8] 0: No force
1: Force clock on for all modes (Run, Sleep and Deep Sleep)

Overrides CLK_EN,  I2SCLKGS.CLK_EN and  I2SCLKGDS.CLK_EN when enabled.
SYSBUS clock will always run when enabled

