btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Acess will only have effect when PERIPH power domain is on, PDSTAT0.PERIPH_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETI2C</name>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <description>RESET For I2C IPs</description>
          <fields>
            <field>
              <name>SPARE1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2C</name>
              <description>[0:0] 0: No action 
1: Reset I2C. HW cleared.

Acess will only have effect when SERIAL power domain is on, PDSTAT0.SERIAL_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETUART</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>RESET For UART IPs</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>UART1</name>
              <description>[1:1] 0: No action 
1: Reset UART1. HW cleared.

Acess will only have effect when PERIPH power domain is on, PDSTAT0.PERIPH_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>UART0</name>
              <description>[0:0] 0: No action 
1: Reset UART0. HW cleared.

Acess will only have effect when SERIAL power domain is on, PDSTAT0.SERIAL_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETSSI</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>RESET For SSI IPs</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SSI</name>
              <description>[1:0] SSI 0: 

0: No action 
1: Reset SSI. HW cleared.

Acess will only have effect when SERIAL power domain is on, PDSTAT0.SERIAL_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.

SSI 1: 

0: No action 
1: Reset SSI. HW cleared.

Acess will only have effect when PERIPH power domain is on, PDSTAT0.PERIPH_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RESETI2S</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>RESET For I2S IP</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>I2S</name>
              <description>[0:0] 0: No action 
1: Reset module. HW cleared.

Acess will only have effect when PERIPH power domain is on, PDSTAT0.PERIPH_ON = 1
Before writing set FLASH:CFG.DIS_READACCESS = 1 to ensure the reset is not activated while executing from flash. This means one cannot execute from flash when using the SW reset.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0</name>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: PERIPH power domain is powered down
1: PERIPH power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: SERIAL power domain is powered down
1: SERIAL power domain is powered up</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] 0: RFC power domain powered off if also PDCTL1.RFC_ON = 0
1: RFC power domain powered on</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0RFC</name>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0SERIAL</name>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL0PERIPH</name>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDCTL0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0</name>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <description>Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>PERIPH_ON</name>
              <description>[2:2] PERIPH Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>[1:1] SERIAL Power domain.

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[0:0] RFC Power domain

0: Domain may be powered down
1: Domain powered up (guaranteed)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0RFC</name>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0SERIAL</name>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <description>SERIAL Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.SERIAL_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT0PERIPH</name>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <description>PERIPH Power Domain Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] Alias for PDSTAT0.PERIPH_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1</name>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <description>Power Domain Control</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>VIMS_MODE</name>
              <description>[4:3] 00: VIMS power domain is only powered when CPU power domain is powered.
01: VIMS power domain is powered whenever the BUS power domain is powered. 
1X: Block power up of VIMS power domain at next wake up. This mode only has effect when VIMS power domain is not powered. Used for Autonomous RF Core.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC power domain powered off if also PDCTL0.RFC_ON = 0 1: RFC power domain powered on  Bit shall be used by RFC in autonomous mode but there is no HW restrictions fom system CPU to access the bit.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: Causes a power down of the CPU power domain when system CPU indicates it is idle. 
1: Initiates power-on of the CPU power domain.

This bit is automatically set by a WIC power-on event.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xA</resetValue>
        </register>
        <register>
          <name>PDCTL1CPU</name>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDCTL1RFC</name>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDCTL1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDCTL1VIMS</name>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <description>VIMS Mode Direct Control</description>
          <fields>
            <field>
              <name>RESERVED2</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:0] This is an alias for PDCTL1.VIMS_MODE</description>
              <bitWidth>2</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1</name>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <description>Power Manager Status</description>
          <fields>
            <field>
              <name>RESERVED5</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>BUS_ON</name>
              <description>[4:4] 0: BUS domain not accessible
1: BUS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>VIMS_ON</name>
              <description>[3:3] 0: VIMS domain not accessible
1: VIMS domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>[2:2] 0: RFC domain not accessible
1: RFC domain is currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>[1:1] 0: CPU and BUS domain not accessible
1: CPU and BUS domains are both currently accessible</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1A</resetValue>
        </register>
        <register>
          <name>PDSTAT1BUS</name>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <description>BUS Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.BUS_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>PDSTAT1RFC</name>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <description>RFC Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.RFC_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PDSTAT1CPU</name>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <description>CPU Power Domain Direct Read Status</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ON</name>
              <description>[0:0] This is an alias for PDSTAT1.CPU_ON</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
