btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
Set by HW. Cleared by writing to OSCICR.HFSRCPENDC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>LFSRCDONERIS</name>
              <description>[6:6] 0: LFSRCDONE has not been qualified
1: LFSRCDONE has been qualified since last clear 

Interrupt is qualified regardless of OSCIMSC.LFSRCDONEIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.LFSRCDONEC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>XOSCDLFRIS</name>
              <description>[5:5] 0: XOSCDLF has not been qualified
1: XOSCDLF has been qualified since last clear. 

Interrupt is qualified regardless of OSCIMSC.XOSCDLFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.XOSCDLFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>XOSCLFRIS</name>
              <description>[4:4] 0: XOSCLF has not been qualified
1: XOSCLF has been qualified since last clear. 

Interrupt is qualified regardless of OSCIMSC.XOSCLFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.XOSCLFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCOSCDLFRIS</name>
              <description>[3:3] 0: RCOSCDLF has not been qualified
1: RCOSCDLF has been qualified since last clear.

Interrupt is qualified regardless of OSCIMSC.RCOSCDLFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.RCOSCDLFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RCOSCLFRIS</name>
              <description>[2:2] 0: RCOSCLF has not been qualified
1: RCOSCLF has been qualified since last clear. 

Interrupt is qualified regardless of OSCIMSC.RCOSCLFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.RCOSCLFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSCHFRIS</name>
              <description>[1:1] 0: XOSCHF has not been qualified
1: XOSCHF has been qualified since last clear. 

Interrupt is qualified regardless of OSCIMSC.XOSCHFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt. 

Set by HW. Cleared by writing to OSCICR.XOSCHFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RCOSCHFRIS</name>
              <description>[0:0] 0: RCOSCHF has not been qualified
1: RCOSCHF has been qualified since last clear. 

Interrupt is qualified regardless of OSCIMSC.RCOSCHFIM setting. The order of qualifying raw interrupt and enable of interrupt mask is indifferent for generating an OSC Interrupt.

Set by HW. Cleared by writing to OSCICR.RCOSCHFC</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OSCICR</name>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <description>Oscillator Raw Interrupt Clear</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HFSRCPENDC</name>
              <description>[7:7] Writing 1 to this field clears the HFSRCPEND raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>LFSRCDONEC</name>
              <description>[6:6] Writing 1 to this field clears the LFSRCDONE raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>XOSCDLFC</name>
              <description>[5:5] Writing 1 to this field clears the XOSCDLF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>XOSCLFC</name>
              <description>[4:4] Writing 1 to this field clears the XOSCLF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RCOSCDLFC</name>
              <description>[3:3] Writing 1 to this field clears the RCOSCDLF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RCOSCLFC</name>
              <description>[2:2] Writing 1 to this field clears the RCOSCLF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>XOSCHFC</name>
              <description>[1:1] Writing 1 to this field clears the XOSCHF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RCOSCHFC</name>
              <description>[0:0] Writing 1 to this field clears the RCOSCHF raw interrupt status. Writing 0 has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
