btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_DBELL</name>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core doorbell

The doorbell module is the main user interface to the radio sub-system. It contains the registers used for both submitting commands to the radio, and for configuring radio interrupts from the RF core.</description>
      <registers>
        <register>
          <name>CMDR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Doorbell Command Register</description>
          <fields>
            <field>
              <name>CMD</name>
              <description>[31:0] Command register. Raises an interrupt to the Command and packet engine (CPE) upon write.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CMDSTA</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Doorbell Command Status Register</description>
          <fields>
            <field>
              <name>STAT</name>
              <description>[31:0] Status of the last command used</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFHWIFG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Interrupt Flags From RF Hardware Modules</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RATCH7</name>
              <description>[19:19] Radio timer channel 7 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RATCH6</name>
              <description>[18:18] Radio timer channel 6 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RATCH5</name>
              <description>[17:17] Radio timer channel 5 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RATCH4</name>
              <description>[16:16] Radio timer channel 4 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RATCH3</name>
              <description>[15:15] Radio timer channel 3 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RATCH2</name>
              <description>[14:14] Radio timer channel 2 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RATCH1</name>
              <description>[13:13] Radio timer channel 1 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RATCH0</name>
              <description>[12:12] Radio timer channel 0 interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>[11:11] RF engine software defined interrupt 2 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>[10:10] RF engine software defined interrupt 1 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>[9:9] RF engine software defined interrupt 0 flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>[8:8] RF engine command done interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TRCTK</name>
              <description>[6:6] Debug tracer system tick interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>[5:5] Modem software defined interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>[4:4] Modem FIFO output interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDMIN</name>
              <description>[3:3] Modem FIFO input interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>[2:2] Modem command done interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[1:1] Frequency synthesizer calibration accelerator interrupt flag. Write zero to clear flag. Write to one has no effect.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>RFHWIEN</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Interrupt Enable For RF Hardware Modules</description>
          <fields>
            <field>
              <name>RESERVED20</name>
              <description>[31:20] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>12</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>RATCH7</name>
              <description>[19:19] Interrupt enable for RFHWIFG.RATCH7.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>RATCH6</name>
              <description>[18:18] Interrupt enable for RFHWIFG.RATCH6.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>RATCH5</name>
              <description>[17:17] Interrupt enable for RFHWIFG.RATCH5.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>RATCH4</name>
              <description>[16:16] Interrupt enable for RFHWIFG.RATCH4.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RATCH3</name>
              <description>[15:15] Interrupt enable for RFHWIFG.RATCH3.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RATCH2</name>
              <description>[14:14] Interrupt enable for RFHWIFG.RATCH2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
            </field>
            <field>
              <name>RATCH1</name>
              <description>[13:13] Interrupt enable for RFHWIFG.RATCH1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>RATCH0</name>
              <description>[12:12] Interrupt enable for RFHWIFG.RATCH0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>[11:11] Interrupt enable for RFHWIFG.RFESOFT2.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>[10:10] Interrupt enable for RFHWIFG.RFESOFT1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>[9:9] Interrupt enable for RFHWIFG.RFESOFT0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>[8:8] Interrupt enable for RFHWIFG.RFEDONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED7</name>
              <description>[7:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>TRCTK</name>
              <description>[6:6] Interrupt enable for RFHWIFG.TRCTK.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>[5:5] Interrupt enable for RFHWIFG.MDMSOFT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>[4:4] Interrupt enable for RFHWIFG.MDMOUT.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDMIN</name>
              <description>[3:3] Interrupt enable for RFHWIFG.MDMIN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>[2:2] Interrupt enable for RFHWIFG.MDMDONE.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[1:1] Interrupt enable for RFHWIFG.FSCA.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[0:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
