btcven/cortex-debug-cc26xx-cc13xx/data/cc2652rb1f.svd
        <register>
          <name>RFCPEISL</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>Interrupt Vector Selection For Command and Packet Engine Generated Interrupts</description>
          <fields>
            <field>
              <name>INTERNAL_ERROR</name>
              <description>[31:31] Select which CPU interrupt vector the RFCPEIFG.INTERNAL_ERROR interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>31</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>[30:30] Select which CPU interrupt vector the RFCPEIFG.BOOT_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>30</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODULES_UNLOCKED</name>
              <description>[29:29] Select which CPU interrupt vector the RFCPEIFG.MODULES_UNLOCKED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNTH_NO_LOCK</name>
              <description>[28:28] Select which CPU interrupt vector the RFCPEIFG.SYNTH_NO_LOCK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ27</name>
              <description>[27:27] Select which CPU interrupt vector the RFCPEIFG.IRQ27 interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ABORTED</name>
              <description>[26:26] Select which CPU interrupt vector the RFCPEIFG.RX_ABORTED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>26</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_N_DATA_WRITTEN</name>
              <description>[25:25] Select which CPU interrupt vector the RFCPEIFG.RX_N_DATA_WRITTEN interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>25</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_DATA_WRITTEN</name>
              <description>[24:24] Select which CPU interrupt vector the RFCPEIFG.RX_DATA_WRITTEN interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_ENTRY_DONE</name>
              <description>[23:23] Select which CPU interrupt vector the RFCPEIFG.RX_ENTRY_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>23</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_BUF_FULL</name>
              <description>[22:22] Select which CPU interrupt vector the RFCPEIFG.RX_BUF_FULL interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>22</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CTRL_ACK</name>
              <description>[21:21] Select which CPU interrupt vector the RFCPEIFG.RX_CTRL_ACK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>21</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CTRL</name>
              <description>[20:20] Select which CPU interrupt vector the RFCPEIFG.RX_CTRL interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>20</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_EMPTY</name>
              <description>[19:19] Select which CPU interrupt vector the RFCPEIFG.RX_EMPTY interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>19</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_IGNORED</name>
              <description>[18:18] Select which CPU interrupt vector the RFCPEIFG.RX_IGNORED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_NOK</name>
              <description>[17:17] Select which CPU interrupt vector the RFCPEIFG.RX_NOK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_OK</name>
              <description>[16:16] Select which CPU interrupt vector the RFCPEIFG.RX_OK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ15</name>
              <description>[15:15] Select which CPU interrupt vector the RFCPEIFG.IRQ15 interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRQ14</name>
              <description>[14:14] Select which CPU interrupt vector the RFCPEIFG.IRQ14 interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FG_COMMAND_STARTED</name>
              <description>[13:13] Select which CPU interrupt vector the RFCPEIFG.FG_COMMAND_STARTED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>13</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMMAND_STARTED</name>
              <description>[12:12] Select which CPU interrupt vector the RFCPEIFG.COMMAND_STARTED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>12</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_BUFFER_CHANGED</name>
              <description>[11:11] Select which CPU interrupt vector the RFCPEIFG.TX_BUFFER_CHANGED interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_ENTRY_DONE</name>
              <description>[10:10] Select which CPU interrupt vector the RFCPEIFG.TX_ENTRY_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_RETRANS</name>
              <description>[9:9] Select which CPU interrupt vector the RFCPEIFG.TX_RETRANS interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL_ACK_ACK</name>
              <description>[8:8] Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK_ACK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL_ACK</name>
              <description>[7:7] Select which CPU interrupt vector the RFCPEIFG.TX_CTRL_ACK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_CTRL</name>
              <description>[6:6] Select which CPU interrupt vector the RFCPEIFG.TX_CTRL interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_ACK</name>
              <description>[5:5] Select which CPU interrupt vector the RFCPEIFG.TX_ACK interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>[4:4] Select which CPU interrupt vector the RFCPEIFG.TX_DONE interrupt should use.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE1</name>
                  <value>1</value>
                  <description>Associate this interrupt line with INT_RF_CPE1 interrupt vector</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE0</name>
                  <value>0</value>
                  <description>Associate this interrupt line with INT_RF_CPE0 interrupt vector</description>
